import random
import datetime
import numpy as np

first_names = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许', '何',
               '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦', '章', '云', '苏',
               '潘', '葛', '奚', '范', '彭', '郎', '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳', '酆', '鲍', '史',
               '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬', '安', '常', '乐', '于', '时', '傅',
               '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹', '姚', '邵', '湛', '汪', '祁',
               '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞', '熊', '纪', '舒', '屈', '项', '祝',
               '董', '梁', '杜', '阮', '蓝', '闵', '席', '季', '麻', '强', '贾', '路', '娄', '危', '江', '童', '颜', '郭', '梅', '盛', '林',
               '刁', '钟', '徐', '邱', '骆', '高', '夏', '蔡', '田', '樊', '胡', '凌', '霍', '虞', '万', '支', '柯', '昝', '管', '卢', '莫',
               '经', '房', '裘', '缪', '干', '解', '应', '宗', '丁', '宣', '贲', '邓', '郁', '单', '杭', '洪', '包', '诸', '左', '石', '崔',
               '吉', '钮', '龚', '程', '嵇', '邢', '滑', '裴', '陆', '荣', '翁', '荀', '羊', '於', '惠', '甄', '麴', '家', '封', '芮', '羿',
               '储', '靳', '汲', '邴', '糜', '松', '井', '段', '富', '巫', '乌', '焦', '巴', '弓', '牧', '隗', '山', '谷', '车', '侯', '宓',
               '蓬', '全', '郗', '班', '仰', '秋', '仲', '伊', '宫', '宁', '仇', '栾', '暴', '甘', '钭', '厉', '戎', '祖', '武', '符', '刘',
               '景', '詹', '束', '龙', '叶', '幸', '司', '韶', '郜', '黎', '蓟', '薄', '印', '宿', '白', '怀', '蒲', '邰', '从', '鄂', '索',
               '咸', '籍', '赖', '卓', '蔺', '屠', '蒙', '池', '乔', '阴', '欎', '胥', '能', '苍', '双', '闻', '莘', '党', '翟', '谭', '贡',
               '劳', '逄', '姬', '申', '扶', '堵', '冉', '宰', '郦', '雍', '舄', '璩', '桑', '桂', '濮', '牛', '寿', '通', '边', '扈', '燕',
               '冀', '郏', '浦', '尚', '农', '温', '别', '庄', '晏', '柴', '瞿', '阎', '充', '慕', '连', '茹', '习', '宦', '艾', '鱼', '容',
               '向', '古', '易', '慎', '戈', '廖', '庾', '终', '暨', '居', '衡', '步', '都', '耿', '满', '弘', '匡', '国', '文', '寇', '广',
               '禄', '阙', '东', '殴', '殳', '沃', '利', '蔚', '越', '夔', '隆', '师', '巩', '厍', '聂', '晁', '勾', '敖', '融', '冷', '訾',
               '辛', '阚', '那', '简', '饶', '空', '曾', '毋', '沙', '乜', '养', '鞠', '须', '丰', '巢', '关', '蒯', '相', '查', '後', '荆',
               '红', '游', '竺', '权', '逯', '盖', '益', '桓', '公', '万俟', '司马', '上官', '欧阳', '夏侯', '诸葛', '闻人', '东方', '赫连', '皇甫',
               '尉迟', '公羊', '澹台', '公冶', '宗政', '濮阳', '淳于', '单于', '太叔', '申屠', '公孙', '仲孙', '轩辕', '令狐', '钟离', '宇文', '长孙',
               '慕容', '鲜于', '闾丘', '司徒', '司空', '亓官', '司寇', '仉', '督', '子车', '颛孙', '端木', '巫马', '公西', '漆雕', '乐正', '壤驷', '公良',
               '拓跋', '夹谷', '宰父', '谷梁', '晋', '楚', '闫', '法', '汝', '鄢', '涂', '钦', '段干', '百里', '东郭', '南门', '呼延', '归', '海',
               '羊舌', '微生', '岳', '帅', '缑', '亢', '况', '后', '有', '琴', '梁丘', '左丘', '东门', '西门', '商', '牟', '佘', '佴', '伯', '赏',
               '南宫', '墨', '哈', '谯', '笪', '年', '爱', '阳', '佟', '第五', '言', '福', '百', '家', '姓', '终']
last_names = ['吉惟', '国瑞', '玟书', '雅南', '奕云', '柏宏', '建安', '子帆', '志豪', '茹定', '中冰', '文隆', '彦文', '智翔', '振霞', '姿婷', '姿康',
              '致盈',
              '一强', '芸贵', '伊雯', '进宝', '美隆', '心真', '美珠', '芳天', '雅惠', '文婷', '敏侑', '依婷', '婉璇', '美玉', '依婷', '昌梦', '家纶',
              '丽昆',
              '育泉', '芸欢', '韵如', '肇芬', '木仲', '成白', '兆玉', '翊惠', '汉臻', '佳瑞', '绿珮', '白芷', '姿妤', '虹伦', '琼玟', '怡芳', '贵妃',
              '佩芳',
              '文旺', '盛玫', '丽青', '智云', '孟涵', '小爱', '恩龙', '政廷', '诗涵', '政倩', '俊伯', '馨学', '惠珠', '思翰', '佩玲', '海来', '翊依',
              '建智',
              '淑芬', '雅琪', '怡宜', '育霖', '仪湖', '俊民', '诗刚', '慧颖', '俊君', '淑妤', '姿伶', '咏钰', '彦宜', '孟儒', '欣臻', '祯韵', '洁启',
              '哲宇',
              '晓萍', '雅萍', '志铭', '茂以', '婉婷', '宜芸', '珮瑜', '柏仪', '逸珮', '雅惠', '采珮', '孟霖', '竹水', '怡乐', '爱乐', '佳蓉', '健毓',
              '士杰',
              '萱珍', '姿婷', '政霖', '志宏', '素达', '虹荣', '美玲', '仪琳', '俞幸', '秋萍', '吉维', '智筠', '书玮', '信峰', '培伦', '瑜舜', '慧萱',
              '士易',
              '建豪', '怡婷', '紫富', '博海', '宏儒', '乔喜', '睿纯', '淑月', '百菁', '雅娥', '佩珊', '必辰', '耀华', '郁婷', '秀玲', '佳儒', '静蓁',
              '舒南',
              '政琳', '绍瑜', '育木', '韦成', '宁政', '廷湖', '展霞', '婉宏', '怡强', '冰宇', '伟依', '元映', '智超', '姿婷', '莉火', '雅雯', '淑芳',
              '枝盈',
              '成彦', '采伶', '大雪', '彦韦', '升毓', '宜瑶', '政文', '宜豪', '宜宁', '志宏', '柔治', '乐妹', '健昀', '雅君', '佩芬', '玮伦', '娇真',
              '佳雯',
              '仁杰', '佳和', '贤青', '怡伶', '怡婷', '晴桦', '翔坤', '孟富', '美玲', '昀琬', '凯修', '蓉芳', '吟琪', '裕忠', '春紫', '美君', '右博',
              '星如',
              '冠杰', '庭玮', '茜彦', '伯薇', '昭祥', '伟伦', '雅慧', '子豪', '彦霖', '合', '雅婷', '圣如', '伶元', '伦军', '佳蓉', '康柔', '成轩', '嘉惠',
              '惠劭', '健铭', '怡婷', '佳蓉', '佩伯', '珮甄', '晓玲', '彦霖', '威强', '佳勋', '静怡', '筠亚', '仲宜', '东贵', '绍翰', '姵来', '雅吉',
              '莉雯',
              '韦荣', '素伦', '菁芷', '玉婷', '智钧', '孟钰', '国伟', '俊达', '雅婷', '礼娇', '忆孝', '静雯', '淳宝', '文育', '佳蓉', '依茂', '淑佩',
              '怡君',
              '美玲', '慧学', '幸韵', '秀琬', '岳平', '爱礼', '一忠', '志雪', '若喜', '承翰', '哲维', '俊安', '礼钰', '佩珊', '鸿信', '欣瑜', '旺劭',
              '怡爱',
              '秀德', '佳伶', '凯婷', '雅任', '国妹', '芳江', '骏生', '儒纯', '培伦', '蕙侑', '宜慧', '信意', '惠雯', '琇纶', '碧仪', '志文', '懿富',
              '凡靖',
              '秀琴', '惠玲', '宗其', '绍泰', '佳慧', '辰纶', '雅雯', '怡财', '雅筑', '伦圣', '正仁', '小紫', '燕达', '佳雨', '婷婷', '怡君', '康刚',
              '辰和',
              '世人', '佩霖', '伟杰', '友淳', '瑞群', '紫芬', '家伟', '佩任', '郁文', '治火', '石美', '雅茜', '台泰', '怡盈', '石意', '盈威', '志嘉',
              '秀玲',
              '彦霖', '惟芷', '星钰', '贞伟', '扬云', '武盛', '雅顺', '欣仪', '政圣', '育福', '惠雯', '淑淑', '莉秋', '俊军', '彦璋', '怡均', '姿辛',
              '雅慧',
              '允坚', '淑珍', '惠美', '凯婷', '承辰', '亭宝', '慧元', '书忠', '仪礼', '哲仪', '怡臻', '孝东', '志合', '力霞', '钰婷', '怡紫', '俊凯',
              '于纬',
              '雅惠', '喜祥', '铭侑', '子珠', '伦吉', '佳雨', '英贤', '嘉茹', '永桂', '文宏', '欣怡', '绍燕', '雅谕', '柏宇', '婉萍', '宗清', '心霖',
              '柏廷',
              '怡臻', '士豪', '春勋', '雅慧', '乔茂', '婉如', '育坚', '静雯', '一蓉', '萱俐', '立妹', '宝其', '信豪', '昆霖', '俊安', '建志', '韦伶',
              '美麟',
              '政达', '惠玲', '忠廷', '美娟', '怡君', '崇南', '承芷', '得梅', '祯月', '宛儒', '肇宪', '益霞', '盛人', '平纬', '雅如', '秀绮', '昌东',
              '家荣',
              '淑君', '俊民', '彦瑜', '彦文', '崇以', '威全', '琳以', '志任', '嘉杰', '志远', '信文', '思廷', '家毓', '宜紫', '毅民', '志平', '坚凤',
              '明春',
              '火劭', '予名', '佩璇', '雅雯', '宗毅', '淑媛', '淑卿', '雅萍', '佩木', '惠玲', '乃亚', '欣怡', '意婷', '明珠', '淑婷', '宏亦', '佳德',
              '正信',
              '淑敏', '佳玲', '佳明', '淑惠', '雅菱', '淳奇', '芳仪', '俊玮', '雯坚', '文贤', '雅雯', '雅俐', '婉婷', '智杰', '玉信', '侑美', '怡婷',
              '世祥',
              '韦水', '彦慈', '峻香', '轩天', '妤军', '佩玲', '美芝', '伦启', '敏爱', '毓娇', '姿君', '姿泰', '圣映', '柏燕', '馨香', '于玟', '山茹',
              '得凤',
              '明翰', '冠强', '文荣', '静雯', '伟孝', '信俊', '美治', '景隆', '怡洁', '钰梦', '静宜', '惠如', '香君']


def getRandomData(df):
    return np.array(df.loc[random.randint(0, len(df) - 1)])


def getRandomTime():
    start = datetime.datetime(2019, 8, 5, 12, 55, 27)
    end = datetime.datetime(2020, 11, 19, 4, 0, 55)
    differ = int((end - start).total_seconds())
    time = start + datetime.timedelta(seconds=random.randint(0, differ))
    return time


def getNextTime(start):
    differ = random.randint(1, 600)
    next_time = start + datetime.timedelta(seconds=differ)
    return next_time


def getRandomName():
    return random.choice(first_names) + random.choice(last_names)
